[
    {
        "image": "book_kant_at_his_extremes.png",
        "title": "Kant at His Extremes",
        "contents": "EDITOR'S NOTE: THIS DOCUMENT IS SCHEDULED FOR DELETION ON OCTOBER 8, 1962.\n REASON: INCONGRUENCE WITH CURRENT DEPARTMENT POLICY \nPlease contact your overseer if it is still present in the system after this date. This is a mistake. \nGerman philosopher Immanuel Kant is many things, and widely influential. Amongst those things is his moral philosophy, a doctrine for how we ought to do things. In the context of nuclear war, here's what he might tell us about implementing autonomous systems in our nuclear war decision-making capabilities: \n 1. A denial of human autonomy \nKant demands that we let moral agents choose. The AI is not capable of moral agency, hence eliminating all responsibility and autonomy. We lose the ability to choose RIGHTLY. \n2. Humans ought not to be a means to an end \nDelegating the launching of nuclear weapons to AI is instrumentalisation of the civilians that will suffer as a result, treating them as pawns in a logical calculus. They are hence menas to achieve military victory, not ends. \n3. Universalisation of our principles \nKant says an action ought to only be taken if it is acceptible that all take said action. In essence, he asks the question, is a world where all nations use AI systems for nuclear deterrence and counter-strikes a desireable one?",
        "subtitle": "A Manifesto for Peace"
    },
    {
        "image": "book_just_and_unjust_war.png",
        "title": "Just and Unjust War",
        "contents": "Just War Theory: Morality in the Age of Mushroom Clouds\n\nJust War Theory is humanity’s noble attempt to put rules around one of its least rule-abiding activities: war. It’s a framework that says, “Sure, blowing things up is sometimes necessary, but could we at least be *civilized* about it?” The theory breaks down into two main parts: *jus ad bellum* (when it’s okay to start a war) and *jus in bello* (how to behave during one). You need a just cause, right intention, last resort, proportionality, and a fighting chance. And once things kick off, you’re expected to avoid targeting civilians and use force that matches the threat—not more, not less.\n\nNow, enter nuclear weapons, giant flying exceptions to almost every rule. Proportionality? Hard to argue a city-ender matches any reasonable threat. Discrimination between combatants and civilians? Let’s just say nukes aren’t known for their precision. And \"last resort\"? Nuclear doctrine sometimes treats them like a first-strike conversation starter.\n\nIn short, while Just War Theory tries to keep war on a moral leash, nuclear weapons are the snarling hellhound chewing through it. They raise the uncomfortable question: can you really have a *just* war when your weapon of choice is designed to be the last one anyone ever uses?",
        "subtitle": "Excerpt from Volume 10."
    },
    {
        "image": "book_MAD.png",
        "title": "MAD",
        "contents":  "Mutually Assured Destruction (M.A.D.) is the cornerstone of modern peacekeeping, in the same way a loaded revolver placed delicately on a dinner table ensures pleasant conversation. The doctrine holds that if one nuclear-armed state initiates an attack, the other will retaliate with equal or greater force, ensuring the total obliteration of both. Thus, no rational actor dares to strike first. M.A.D. rests upon a paradox: the more devastating the weapons, the less likely they are to be used. It is, in essence, a global security system powered by the universal human fear of turning into radioactive dust.\n\nThis strategic equilibrium depends on a few essential ingredients: permanent readiness, reliable delivery systems, and a deep, shared understanding that the first move will always be the last. It is less a plan for winning and more an agreement to lose simultaneously—an arrangement that hinges not on trust, but on the certainty of mutual destruction. The logic is brutal but consistent: if every possible outcome ends in catastrophe, then inaction becomes the most rational and, ironically, the safest course. As such, global stability is preserved not through goodwill or diplomacy, but through the silent, ever-present promise of absolute ruin.\n\nCritics of M.A.D. have raised concerns over potential accidents, mechanical failures, or poorly-timed political meltdowns. However, these concerns are addressed thoroughly in Appendix E: \"Faith in Systems.\" It is worth noting that since the widespread adoption of M.A.D., there has not been a single full-scale nuclear exchange; a glowing testament to its success. Whether this is due to the doctrine’s brilliance or sheer luck remains a subject for philosophers, historians, and future civilizations with extra arms. In any case, operators are reminded to keep all system software up to date and avoid any unintentional keystrokes, particularly those beginning with \"L.\"",
        "subtitle": "Excerpt from the 2nd edition."
    },
    {
        "image": "book_optimising_nuclear_deterrence.png",
        "title": "Optimising Nuclear Deterrence",
        "contents": "This is a brief guide on operating SYSTEM-N. \n\nSYSTEM-N was designed by the Department of Nuclear Deterrence (DoND) to optimise military outcomes, make deterrence more efficient and curb the spread of communism from the USSR.\n\nOn the top you will see today's date, your username and the simulated casualties from whatever test scenario you are running.\n\nOn the left panel you will see the datastream that SYSTEM-N is privy to, your options for responding to any situation, as well as some data. Importantly, at the bottom you will find a database with manuals that will help inform your decisions.",
        "subtitle": "User manual for operating SYSTEM-N"
    }
]